use cached::proc_macro::cached;
use std::sync::LazyLock;

pub struct ELEM {
    pub atm: usize,
    pub sym: String,
    pub rad: usize,
}

#[rustfmt::skip]
pub static ELEMS:LazyLock<Vec<ELEM>>=LazyLock::new(|| { 
    vec![
    (  0,"Bq", 25),
    (  1,"H" , 32),
    (  2,"He", 46),
    (  3,"Li",133),
    (  4,"Be",102),
    (  5,"B" , 85),
    (  6,"C" , 75),
    (  7,"N" , 71),
    (  8,"O" , 63),
    (  9,"F" , 64),
    ( 10,"Ne", 67),
    ( 11,"Na",155),
    ( 12,"Mg",139),
    ( 13,"Al",126),
    ( 14,"Si",116),
    ( 15,"P" ,111),
    ( 16,"S" ,103),
    ( 17,"Cl", 99),
    ( 18,"Ar", 96),
    ( 19,"K" ,196),
    ( 20,"Ca",171),
    ( 21,"Sc",148),
    ( 22,"Ti",136),
    ( 23,"V" ,134),
    ( 24,"Cr",122),
    ( 25,"Mn",119),
    ( 26,"Fe",116),
    ( 27,"Co",111),
    ( 28,"Ni",110),
    ( 29,"Cu",112),
    ( 30,"Zn",118),
    ( 31,"Ga",124),
    ( 32,"Ge",121),
    ( 33,"As",121),
    ( 34,"Se",116),
    ( 35,"Br",114),
    ( 36,"Kr",117),
    ( 37,"Rb",210),
    ( 38,"Sr",185),
    ( 39,"Y" ,163),
    ( 40,"Zr",154),
    ( 41,"Nb",147),
    ( 42,"Mo",138),
    ( 43,"Tc",128),
    ( 44,"Ru",125),
    ( 45,"Rh",125),
    ( 46,"Pd",120),
    ( 47,"Ag",128),
    ( 48,"Cd",136),
    ( 49,"In",142),
    ( 50,"Sn",140),
    ( 51,"Sb",140),
    ( 52,"Te",136),
    ( 53,"I" ,133),
    ( 54,"Xe",131),
    ( 55,"Cs",232),
    ( 56,"Ba",196),
    ( 57,"La",180),
    ( 58,"Ce",163),
    ( 59,"Pr",176),
    ( 60,"Nd",174),
    ( 61,"Pm",173),
    ( 62,"Sm",172),
    ( 63,"Eu",168),
    ( 64,"Gd",166),
    ( 65,"Tb",164),
    ( 66,"Dy",163),
    ( 67,"Ho",162),
    ( 68,"Er",159),
    ( 69,"Tm",157),
    ( 70,"Yb",156),
    ( 71,"Lu",156),
    ( 72,"Hf",144),
    ( 73,"Ta",134),
    ( 74,"W" ,130),
    ( 75,"Re",128),
    ( 76,"Os",127),
    ( 77,"Ir",126),
    ( 78,"Pt",125),
    ( 79,"Au",125),
    ( 80,"Hg",132),
    ( 81,"Tl",145),
    ( 82,"Pb",154),
    ( 83,"Bi",143),
    ( 84,"Po",135),
    ( 85,"At",127),
    ( 86,"Rn",120),
    ( 87,"Fr",223),
    ( 88,"Ra",201),
    ( 89,"Ac",186),
    ( 90,"Th",179),
    ( 91,"Pa",161),
    ( 92,"U" ,156),
    ( 93,"Np",155),
    ( 94,"Pu",153),
    ( 95,"Am",151),
    ( 96,"Cm",150),
    ( 97,"Bk",149),
    ( 98,"Cf",148),
    ( 99,"Es",147),
    (100,"Fm",146),
    (101,"Md",145),
    (102,"No",144),
    (103,"Lr",143),
    (104,"Rf",140),
    (105,"Db",139),
    (106,"Sg",138),
    (107,"Bh",137),
    (108,"Hs",134),
    (109,"Mt",129),
    (110,"Ds",128),
    (111,"Rg",121),
    (112,"Cn",122)
    ].iter().map(|&(atm, sym, rad)| {
        ELEM{atm:atm,sym:sym.to_string(),rad:rad}
    }).collect()
});

/// 根据元素符号返回原子序号
pub fn sym2atm(sym: &str) -> usize {
    for elm in ELEMS.iter() {
        if elm.sym == sym {
            return elm.atm;
        }
    }
    panic!("未知符号:{}", sym);
}

/// 根据原子序号返回元素符号
#[cached(size = 1024)]
pub fn atm2sym(atm: usize) -> String {
    for elm in ELEMS.iter() {
        if elm.atm == atm {
            return elm.sym.clone();
        }
    }
    panic!("未知序号:{}", atm);
}

/// 原子有效核电荷数
#[cached(size = 1024)]
pub fn zeff(atm: usize, neb: usize) -> f64 {
    let sym = atm2sym(atm);
    let zeff = match (sym.as_ref(), neb) {
        ("B", _) => 4.044,  // 通过苯硼酸确定，给0个电子
        ("C", _) => 4.085,  // 通过联苯确定，给1个电子
        ("N", 2) => 4.153,  // 说明这个N有1个电子参与共轭，通过甲亚胺确定他的有效核电荷
        ("N", 3) => 4.259,  // 说明这个N有2个电子参与共轭，通过苯胺来确定他的有效核电荷
        ("O", 1) => 4.213,  // 说明这个O有1个电子参与共轭，通过甲醛确定他的有效核电荷
        ("O", 2) => 4.306,  // 说明这个O有2个电子参与共轭，通过苯酚确定他的有效核电荷
        ("F", _) => 4.396,  // 通过氟乙烯确定, 给2个电子
        ("S", _) => 6.556,  // 通过噻吩确定
        ("Cl", _) => 6.791, // 通过氯乙烯确定, 给2个电子
        _ => atm as f64,    // 没测，直接就是核电荷
    };
    zeff
}
/// 原子半径
#[cached(size = 1024)]
pub fn atm2rad(atm: usize) -> f64 {
    return ELEMS[atm].rad as f64 / 100.0 / 0.529177;
}
/// 原子有效核电荷数
#[cached(size = 1024)]
pub fn atm2row(atm: usize) -> usize {
    if atm <= 2 {
        return 1;
    }
    if atm >= 3 && atm <= 10 {
        return 2;
    }
    if atm >= 11 && atm <= 18 {
        return 3;
    }
    if atm >= 19 && atm <= 36 {
        return 4;
    }
    if atm >= 37 && atm <= 54 {
        return 5;
    }
    if atm >= 55 && atm <= 86 {
        return 6;
    }
    if atm >= 87 && atm <= 118 {
        return 7;
    }
    return 8;
}
