use cached::proc_macro::cached;
use std::sync::LazyLock;

#[derive(Clone)]
pub struct ELEM {
    pub idx: usize,
    pub sym: String,
    pub rad: f64,
    pub row: usize,
    pub col: usize,
}

#[rustfmt::skip]
pub static ELEMS:LazyLock<Vec<ELEM>>=LazyLock::new(|| {
    vec![
    (  0,"Bq", 25, 0, 0),
    (  1,"H" , 32, 1, 1),
    (  2,"He", 46, 1,18),
    (  3,"Li",133, 2, 1),
    (  4,"Be",102, 2, 2),
    (  5,"B" , 85, 2,13),
    (  6,"C" , 75, 2,14),
    (  7,"N" , 71, 2,15),
    (  8,"O" , 63, 2,16),
    (  9,"F" , 64, 2,17),
    ( 10,"Ne", 67, 2,18),
    ( 11,"Na",155, 3, 1),
    ( 12,"Mg",139, 3, 2),
    ( 13,"Al",126, 3,13),
    ( 14,"Si",116, 3,14),
    ( 15,"P" ,111, 3,15),
    ( 16,"S" ,103, 3,16),
    ( 17,"Cl", 99, 3,17),
    ( 18,"Ar", 96, 3,18),
    ( 19,"K" ,196, 4, 1),
    ( 20,"Ca",171, 4, 2),
    ( 21,"Sc",148, 4, 3),
    ( 22,"Ti",136, 4, 4),
    ( 23,"V" ,134, 4, 5),
    ( 24,"Cr",122, 4, 6),
    ( 25,"Mn",119, 4, 7),
    ( 26,"Fe",116, 4, 8),
    ( 27,"Co",111, 4, 9),
    ( 28,"Ni",110, 4,10),
    ( 29,"Cu",112, 4,11),
    ( 30,"Zn",118, 4,12),
    ( 31,"Ga",124, 4,13),
    ( 32,"Ge",121, 4,14),
    ( 33,"As",121, 4,15),
    ( 34,"Se",116, 4,16),
    ( 35,"Br",114, 4,17),
    ( 36,"Kr",117, 4,18),
    ( 37,"Rb",210, 5, 1),
    ( 38,"Sr",185, 5, 2),
    ( 39,"Y" ,163, 5, 3),
    ( 40,"Zr",154, 5, 4),
    ( 41,"Nb",147, 5, 5),
    ( 42,"Mo",138, 5, 6),
    ( 43,"Tc",128, 5, 7),
    ( 44,"Ru",125, 5, 8),
    ( 45,"Rh",125, 5, 9),
    ( 46,"Pd",120, 5,10),
    ( 47,"Ag",128, 5,11),
    ( 48,"Cd",136, 5,12),
    ( 49,"In",142, 5,13),
    ( 50,"Sn",140, 5,14),
    ( 51,"Sb",140, 5,15),
    ( 52,"Te",136, 5,16),
    ( 53,"I" ,133, 5,17),
    ( 54,"Xe",131, 5,18),
    ( 55,"Cs",232, 6, 1),
    ( 56,"Ba",196, 6, 2),
    ( 57,"La",180, 6, 3),
    ( 58,"Ce",163, 8, 3),
    ( 59,"Pr",176, 8, 4),
    ( 60,"Nd",174, 8, 5),
    ( 61,"Pm",173, 8, 6),
    ( 62,"Sm",172, 8, 7),
    ( 63,"Eu",168, 8, 8),
    ( 64,"Gd",166, 8, 9),
    ( 65,"Tb",164, 8,10),
    ( 66,"Dy",163, 8,11),
    ( 67,"Ho",162, 8,12),
    ( 68,"Er",159, 8,13),
    ( 69,"Tm",157, 8,14),
    ( 70,"Yb",156, 8,15),
    ( 71,"Lu",156, 8,16),
    ( 72,"Hf",144, 6, 4),
    ( 73,"Ta",134, 6, 5),
    ( 74,"W" ,130, 6, 6),
    ( 75,"Re",128, 6, 7),
    ( 76,"Os",127, 6, 8),
    ( 77,"Ir",126, 6, 9),
    ( 78,"Pt",125, 6,10),
    ( 79,"Au",125, 6,11),
    ( 80,"Hg",132, 6,12),
    ( 81,"Tl",145, 6,13),
    ( 82,"Pb",154, 6,14),
    ( 83,"Bi",143, 6,15),
    ( 84,"Po",135, 6,16),
    ( 85,"At",127, 6,17),
    ( 86,"Rn",120, 6,18),
    ( 87,"Fr",223, 7, 1),
    ( 88,"Ra",201, 7, 2),
    ( 89,"Ac",186, 7, 3),
    ( 90,"Th",179, 9, 3),
    ( 91,"Pa",161, 9, 4),
    ( 92,"U" ,156, 9, 5),
    ( 93,"Np",155, 9, 6),
    ( 94,"Pu",153, 9, 7),
    ( 95,"Am",151, 9, 8),
    ( 96,"Cm",150, 9, 9),
    ( 97,"Bk",149, 9,10),
    ( 98,"Cf",148, 9,11),
    ( 99,"Es",147, 9,12),
    (100,"Fm",146, 9,13),
    (101,"Md",145, 9,14),
    (102,"No",144, 9,15),
    (103,"Lr",143, 9,16),
    (104,"Rf",140, 7, 4),
    (105,"Db",139, 7, 5),
    (106,"Sg",138, 7, 6),
    (107,"Bh",137, 7, 7),
    (108,"Hs",134, 7, 8),
    (109,"Mt",129, 7, 9),
    (110,"Ds",128, 7,10),
    (111,"Rg",121, 7,11),
    (112,"Cn",122, 7, 1)
    ].iter().map(|&(idx, sym, rad,row,col)| {
        let sym=sym.to_string();
        let rad=rad as f64 / 100.0 / 0.529177;
        ELEM{idx, sym, rad, row, col}
    }).collect()
});

/// 通过元素符号获取元素
#[cached(key = "String", convert = r"{ sym.to_string() }")]
pub fn get_by_sym(sym: &str) -> ELEM {
    for elm in ELEMS.iter() {
        if elm.sym == sym {
            return elm.clone();
        }
    }
    panic!("未知符号:{}", sym);
}

/// 通过元素序号获取元素
#[cached]
pub fn get_by_idx(idx: usize) -> ELEM {
    for elm in ELEMS.iter() {
        if elm.idx == idx {
            return elm.clone();
        }
    }
    panic!("未知索引:{}", idx);
}

/// 根据元素符号返回原子序号
pub fn sym2atm(sym: &str) -> usize {
    for elm in ELEMS.iter() {
        if elm.sym == sym {
            return elm.idx;
        }
    }
    panic!("未知符号:{}", sym);
}

/// 根据原子序号返回元素符号
#[cached(size = 1024)]
pub fn atm2sym(atm: usize) -> String {
    for elm in ELEMS.iter() {
        if elm.idx == atm {
            return elm.sym.clone();
        }
    }
    panic!("未知序号:{}", atm);
}

/// 原子有效核电荷数
#[cached(size = 1024)]
pub fn zeff(atm: usize, neb: usize) -> f64 {
    let sym = atm2sym(atm);
    let zeff = match (sym.as_ref(), neb) {
        ("B", _) => 4.044,  // 通过苯硼酸确定，给0个电子
        ("C", _) => 4.085,  // 通过联苯确定，给1个电子
        ("N", 2) => 4.153,  // 说明这个N有1个电子参与共轭，通过甲亚胺确定他的有效核电荷
        ("N", 3) => 4.259,  // 说明这个N有2个电子参与共轭，通过苯胺来确定他的有效核电荷
        ("O", 1) => 4.213,  // 说明这个O有1个电子参与共轭，通过甲醛确定他的有效核电荷
        ("O", 2) => 4.306,  // 说明这个O有2个电子参与共轭，通过苯酚确定他的有效核电荷
        ("F", _) => 4.396,  // 通过氟乙烯确定, 给2个电子
        ("S", _) => 6.556,  // 通过噻吩确定
        ("Cl", _) => 6.791, // 通过氯乙烯确定, 给2个电子
        _ => atm as f64,    // 没测，直接就是核电荷
    };
    zeff
}

/// 原子半径
#[cached(size = 1024)]
pub fn atm2rad(atm: usize) -> f64 {
    return ELEMS[atm].rad;
}
/// 原子有效核电荷数
#[cached(size = 1024)]
pub fn atm2row(atm: usize) -> usize {
    if atm <= 2 {
        return 1;
    }
    if atm >= 3 && atm <= 10 {
        return 2;
    }
    if atm >= 11 && atm <= 18 {
        return 3;
    }
    if atm >= 19 && atm <= 36 {
        return 4;
    }
    if atm >= 37 && atm <= 54 {
        return 5;
    }
    if atm >= 55 && atm <= 86 {
        return 6;
    }
    if atm >= 87 && atm <= 118 {
        return 7;
    }
    return 8;
}
